<!-- 首页-课程导航 -->
<?php include 'include/header.html.php' ?>
<div id="container">
    <?php include 'include/nav.html.php' ?>
    <div id="content">
        <h2 class="alignCenter">课程导航</h2>
        <h4>课程特色之一： 实践与考核互动，以实际案例和创新性激励机制带动学生学习积极性</h4>
        <p class="paraIndent">针对课程教学很容易流于形式的问题，可以考核方法改革与教研结合为手段，以大型实验项目模拟真实环境，激发学生自主性学习，达到全面培养现代软件工程师能力的目的。</p>
        <h4>课程特色之二： 科研与教学互动，科研为教学及时补充前沿理论，教学为科研输送得力干将</h4>
        <p class="paraIndent">针对软件工程知识点更新快的问题，解决的重点在于使教学队伍年轻化，教师注重将最新科研成果融入教学工作，以科研促进教学，才能不断更新教学内容，紧跟学科发展的前沿。</p>
        <h4>课程特色之三： 网络与现场学习互动，全方位满足学生即时沟通和个性化学习的需要</h4>
        <p class="paraIndent">针对单一教学手段不能满足学生团队沟通与个性化学习需要的问题，我们认为网络化教学手段可以成为对传统教学手段的重要补充。</p>
        <h4>课程特色之四： 重视同行交流，通过教材、论文、报告广泛推广经验，影响力覆盖全国</h4>
        <p class="paraIndent">通过一系列教学改革，学生对课程评估反映很好，主讲教师评分均居于学院教师的前列。该课程建设成果2005年被评为浙江大学校级精品课程、2006年被评为教育部IBM精品课程、浙江大学优质课程。</p>
    </div>
</div>
<?php include 'include/footer.html.php' ?>

